mockserver-client/src/banco-industrial-expectations/datos-cliente.js

export const datosClienteExpectations = [
    {
        "httpRequest": {
            "method": "POST",
            "path": "ws_ConsultaDatosBEL",
            "body": {
                "type" : "XML",
                "xml": `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://www.bi.com.gt/ConsultaDatosBEL/">
                <soapenv:Header/>
                <soapenv:Body>
                   <con:DatosCliente>
                      <CIF>\${xmlunit.isNumber}</CIF>
                   </con:DatosCliente>
                </soapenv:Body>
             </soapenv:Envelope>`
            }
        },
        "httpResponse": {
            "statusCode": 200,
            "body": {
                "type": "XML",
                "xml" : `<?xml version="1.0" encoding="UTF-8"?><NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/"><NS1:Body><NS2:DatosClienteResponse xmlns:NS2="http://www.bi.com.gt/ConsultaDatosBEL/"><CodRespuesta>0000</CodRespuesta><MsgRespuesta>RESPUESTA EXITOSA</MsgRespuesta><Cliente><PrimerApellido>SAQUIC</PrimerApellido><SegundoApellido>TIZOL</SegundoApellido><ApellidoCasada></ApellidoCasada><Nombres>BRYAN ALBERT</Nombres><Nomenclatura>SAN FELIPE XEJUYUP CAMINO OLIN</Nomenclatura><Zona>00</Zona><Colonia></Colonia><Depto>08</Depto><Mupio>004</Mupio><FechaNacimiento>28011997</FechaNacimiento><LugarNacimiento>001</LugarNacimiento><Nacionalidad>001</Nacionalidad><OtraNacionalidad>000</OtraNacionalidad><EstadoCivil>1</EstadoCivil><Genero>1</Genero><TipoID>1</TipoID><IDEmitidoEn>000</IDEmitidoEn><NumID>3076165330804</NumID><Celular>40585668</Celular><TelFijo>00000000</TelFijo><FechaVencimientoID>00000000</FechaVencimientoID><CondMigra>00</CondMigra><OtraCondMigra></OtraCondMigra><Email>BRYANTIZOLG12@GMAIL.COM</Email><ProfesionOficio>06</ProfesionOficio><Nit>107754789</Nit><RelaDep>0</RelaDep><NegPropio>0</NegPropio><OtrasFuentes>0</OtrasFuentes></Cliente><Dependencias><Sector>0</Sector><NomEmpresa>INSTITUTO DE SEGURIODAD SOCIAL IGSS</NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><TotalIngresos>0.00</TotalIngresos><EsPEP>2</EsPEP><ParentescoPEP>2</ParentescoPEP><AsocPEP>2</AsocPEP><EsCPE>2</EsCPE></NS2:DatosClienteResponse></NS1:Body></NS1:Envelope>`
            }
        }
    },
    {
        "httpRequest": {
            "method": "POST",
            "path": "ws_ConsultaDatosBEL",
            "body": {
                "type" : "XML",
                "xml": `<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">  
                    <soapenv:Header/>  
                    <soapenv:Body>    
                        <ns1:DatosCliente
                            xmlns:ns1="http://www.bi.com.gt/ConsultaDatosBEL/">      
                            <DatosCliente>        
                                <CIF>\${xmlunit.isNumber}</CIF>
                            </DatosCliente>    
                        </ns1:DatosCliente>  
                    </soapenv:Body>
                </soapenv:Envelope>`
            }
        },
        "httpResponse": {
            "statusCode": 200,
            "body": {
                "type": "XML",
                "xml" : `<?xml version="1.0" encoding="UTF-8"?><NS1:Envelope xmlns:NS1="http://schemas.xmlsoap.org/soap/envelope/"><NS1:Body><NS2:DatosClienteResponse xmlns:NS2="http://www.bi.com.gt/ConsultaDatosBEL/"><CodRespuesta>0000</CodRespuesta><MsgRespuesta>RESPUESTA EXITOSA</MsgRespuesta><Cliente><PrimerApellido>SAQUIC</PrimerApellido><SegundoApellido>TIZOL</SegundoApellido><ApellidoCasada></ApellidoCasada><Nombres>BRYAN ALBERT</Nombres><Nomenclatura>SAN FELIPE XEJUYUP CAMINO OLIN</Nomenclatura><Zona>00</Zona><Colonia></Colonia><Depto>08</Depto><Mupio>004</Mupio><FechaNacimiento>28011997</FechaNacimiento><LugarNacimiento>001</LugarNacimiento><Nacionalidad>001</Nacionalidad><OtraNacionalidad>000</OtraNacionalidad><EstadoCivil>1</EstadoCivil><Genero>1</Genero><TipoID>1</TipoID><IDEmitidoEn>000</IDEmitidoEn><NumID>3076165330804</NumID><Celular>40585668</Celular><TelFijo>00000000</TelFijo><FechaVencimientoID>00000000</FechaVencimientoID><CondMigra>00</CondMigra><OtraCondMigra></OtraCondMigra><Email>BRYANTIZOLG12@GMAIL.COM</Email><ProfesionOficio>06</ProfesionOficio><Nit>107754789</Nit><RelaDep>0</RelaDep><NegPropio>0</NegPropio><OtrasFuentes>0</OtrasFuentes></Cliente><Dependencias><Sector>0</Sector><NomEmpresa>INSTITUTO DE SEGURIODAD SOCIAL IGSS</NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Dependencias><Sector>0</Sector><NomEmpresa></NomEmpresa><Puesto></Puesto><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><Moneda></Moneda><Ingresos>0.00</Ingresos></Dependencias><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><Negocios><Nombre></Nombre><Nit></Nit><FechaInsc>00000000</FechaInsc><ActEco>000</ActEco><ActEcoEspec>000</ActEcoEspec><OtraActEco></OtraActEco><PatRegistro></PatRegistro><PatFolio>000000</PatFolio><PatLibro>000000</PatLibro><PatExpediente></PatExpediente><Nomenclatura></Nomenclatura><Zona>00</Zona><Depto>00</Depto><Mupio>000</Mupio><Pais>000</Pais><Moneda></Moneda><Ingresos>0.00</Ingresos></Negocios><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><OtrasFuentesDeIngresos><OtrasFuentes>00</OtrasFuentes><Especificas>000</Especificas><Otras></Otras><Moneda></Moneda><Ingresos>0.00</Ingresos></OtrasFuentesDeIngresos><TotalIngresos>0.00</TotalIngresos><EsPEP>2</EsPEP><ParentescoPEP>2</ParentescoPEP><AsocPEP>2</AsocPEP><EsCPE>2</EsCPE></NS2:DatosClienteResponse></NS1:Body></NS1:Envelope>`
            }
        }
    }
]